### 1880년 부터 2014년까지의 미국의 아기 이름을 정리해논 데이터셋

In [1]:
baby <-read.csv("../Data/R_Baby_Names_1880-2014.csv", stringsAsFactors = F,  fileEncoding="utf-8")
head(baby)

  Name      Gender Count Year                   Year.Rank
1 Mary      F      7065  01/01/1880 12:00:00 AM 1
2 Anna      F      2604  01/01/1880 12:00:00 AM 2
3 Emma      F      2003  01/01/1880 12:00:00 AM 3
4 Elizabeth F      1939  01/01/1880 12:00:00 AM 4
5 Minnie    F      1746  01/01/1880 12:00:00 AM 5
6 Margaret  F      1578  01/01/1880 12:00:00 AM 6

In [2]:
tail(baby)

        Name    Gender Count Year                   Year.Rank
1825383 Zyel    M      5     01/01/2014 12:00:00 AM 13972
1825384 Zykeem  M      5     01/01/2014 12:00:00 AM 13973
1825385 Zymeer  M      5     01/01/2014 12:00:00 AM 13974
1825386 Zymiere M      5     01/01/2014 12:00:00 AM 13975
1825387 Zyran   M      5     01/01/2014 12:00:00 AM 13976
1825388 Zyrin   M      5     01/01/2014 12:00:00 AM 13977

In [3]:
str(baby)

'data.frame':	1825388 obs. of  5 variables:
 $ Name     : chr  "Mary" "Anna" "Emma" "Elizabeth" ...
 $ Gender   : chr  "F" "F" "F" "F" ...
 $ Count    : int  7065 2604 2003 1939 1746 1578 1472 1414 1320 1288 ...
 $ Year     : chr  "01/01/1880 12:00:00 AM" "01/01/1880 12:00:00 AM" "01/01/1880 12:00:00 AM" "01/01/1880 12:00:00 AM" ...
 $ Year.Rank: int  1 2 3 4 5 6 7 8 9 10 ...

In [4]:
baby$Gender <- as.factor(baby$Gender)
str(baby)

'data.frame':	1825388 obs. of  5 variables:
 $ Name     : chr  "Mary" "Anna" "Emma" "Elizabeth" ...
 $ Gender   : Factor w/ 2 levels "F","M": 1 1 1 1 1 1 1 1 1 1 ...
 $ Count    : int  7065 2604 2003 1939 1746 1578 1472 1414 1320 1288 ...
 $ Year     : chr  "01/01/1880 12:00:00 AM" "01/01/1880 12:00:00 AM" "01/01/1880 12:00:00 AM" "01/01/1880 12:00:00 AM" ...
 $ Year.Rank: int  1 2 3 4 5 6 7 8 9 10 ...

In [5]:
# baby의 Year부분 정리하기
baby$Year<-substr(baby$Year,7,10) #7~10
head(baby)

  Name      Gender Count Year Year.Rank
1 Mary      F      7065  1880 1
2 Anna      F      2604  1880 2
3 Emma      F      2003  1880 3
4 Elizabeth F      1939  1880 4
5 Minnie    F      1746  1880 5
6 Margaret  F      1578  1880 6

In [6]:
# 저장하기
write.csv(baby,"../Data/baby.csv", row.names=F,  fileEncoding="utf-8")

In [7]:
head(baby)

  Name      Gender Count Year Year.Rank
1 Mary      F      7065  1880 1
2 Anna      F      2604  1880 2
3 Emma      F      2003  1880 3
4 Elizabeth F      1939  1880 4
5 Minnie    F      1746  1880 5
6 Margaret  F      1578  1880 6

In [8]:
#baby에서 여자 아이만 Female이라는 dataset를 만들고 row수 구하기

Female <- subset(baby,Gender == "F")
head(Female)

  Name      Gender Count Year Year.Rank
1 Mary      F      7065  1880 1
2 Anna      F      2604  1880 2
3 Emma      F      2003  1880 3
4 Elizabeth F      1939  1880 4
5 Minnie    F      1746  1880 5
6 Margaret  F      1578  1880 6

In [9]:
# 여자 아이 이름중 중복 제거하고 갯수 구하기
length(unique(Female$Name))

[1] 64911

In [10]:
# 유일한 여자 아이 이름 20개만 출력하기
head(unique(Female$Name),20)

 [1] "Mary"      "Anna"      "Emma"      "Elizabeth" "Minnie"    "Margaret"
 [7] "Ida"       "Alice"     "Bertha"    "Sarah"     "Annie"     "Clara"
[13] "Ella"      "Florence"  "Cora"      "Martha"    "Laura"     "Nellie"
[19] "Grace"     "Carrie"

---
### 가장 많이 사용된 여자 아이 이름 10개 보여주기

In [11]:
library(dplyr)

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [12]:
Female_count<-aggregate(Count~Name,Female,sum)
head(arrange(Female_count,desc(Count)),10)

   Name      Count
1  Mary      4115282
2  Elizabeth 1601128
3  Patricia  1570567
4  Jennifer  1462742
5  Linda     1450843
6  Barbara   1432944
7  Margaret  1240006
8  Susan     1120469
9  Dorothy   1105680
10 Sarah     1060643

In [13]:
# baby에서 남자 아이만 Male이라는 데어테넷을 만들고 row수 구하기

Male <- subset(baby,Gender =="M")
nrow(Male)

[1] 743728

In [14]:
Female_y<-aggregate(Count~Year,Female,sum)
Female_y

    Year Count
1   1880  90993
2   1881  91954
3   1882 107850
4   1883 112321
5   1884 129022
6   1885 133055
7   1886 144535
8   1887 145982
9   1888 178627
10  1889 178366
11  1890 190377
12  1891 185482
13  1892 212346
14  1893 212906
15  1894 222922
16  1895 233630
17  1896 237920
18  1897 234202
19  1898 258770
20  1899 233023
21  1900 299828
22  1901 239348
23  1902 264077
24  1903 261973
25  1904 275366
26  1905 291623
27  1906 295303
28  1907 318566
29  1908 334313
30  1909 347228
... ...  ...
106 1985 1720036
107 1986 1714664
108 1987 1737891
109 1988 1779839
110 1989 1843105
111 1990 1897709
112 1991 1874434
113 1992 1843304
114 1993 1808379
115 1994 1785074
116 1995 1757927
117 1996 1752249
118 1997 1739806
119 1998 1765915
120 1999 1772632
121 2000 1814601
122 2001 1799049
123 2002 1795206
124 2003 1825359
125 2004 1834145
126 2005 1845379
127 2006 1898463
128 2007 1919408
129 2008 1887234
130 2009 1832925
131 2010 1772738
132 2011 1753500
133 2012 1753922
134 2013 1745339
135 2014 1768775

In [15]:
Male_y<-aggregate(Count~Year,Female,sum)
Male_y

    Year Count
1   1880  90993
2   1881  91954
3   1882 107850
4   1883 112321
5   1884 129022
6   1885 133055
7   1886 144535
8   1887 145982
9   1888 178627
10  1889 178366
11  1890 190377
12  1891 185482
13  1892 212346
14  1893 212906
15  1894 222922
16  1895 233630
17  1896 237920
18  1897 234202
19  1898 258770
20  1899 233023
21  1900 299828
22  1901 239348
23  1902 264077
24  1903 261973
25  1904 275366
26  1905 291623
27  1906 295303
28  1907 318566
29  1908 334313
30  1909 347228
... ...  ...
106 1985 1720036
107 1986 1714664
108 1987 1737891
109 1988 1779839
110 1989 1843105
111 1990 1897709
112 1991 1874434
113 1992 1843304
114 1993 1808379
115 1994 1785074
116 1995 1757927
117 1996 1752249
118 1997 1739806
119 1998 1765915
120 1999 1772632
121 2000 1814601
122 2001 1799049
123 2002 1795206
124 2003 1825359
125 2004 1834145
126 2005 1845379
127 2006 1898463
128 2007 1919408
129 2008 1887234
130 2009 1832925
131 2010 1772738
132 2011 1753500
133 2012 1753922
134 2013 1745339
135 2014 1768775

In [16]:
par(family = "AppleGothic")

plot(,
)

ERROR: Error in xy.coords(x, y, xlabel, ylabel, log): 기본값이 없는 인수 "x"가 누락되어 있습니다